cluster setup

node show -fields serialnumber

version
version -b

#license
license add xxxxxxxxxxxxxxx
license show

#timezone
shlab3::> timezone Asia/Shanghai
shlab3::> timezone 
shlab3::> date

NTP:

cluster time-service ntp server create -server 172.16.1.92
cluster time-service ntp server sho


DNS:

dns create -vserver shlab3 -domains remotelab.net -name-servers 172.16.1.92
dns show

Route
network route show

SP:

shlab2::> sp network modify -node FAS2240-02 -address-family IPv4 -ip-address 172.16.1.74 -netmask 255.255.254.0 -gateway 172.16.1.1 -enable true

sp net show -fields ip 

#check cdpd:
run  * -command options cdpd.enable on
run  * -command options cdpd.enable
run * -command cdpd show-neighbors

#check switchless config
set adv #set admin

switchless-cluster show

health status show

#update ontap:
storage failover modify -node * -auto-giveback false
storage failover show -node * -fields  auto-giveback

set adv
cluster image package get -url http://192.168.1.121/96P3_q_image.tgz
cluster image show
cluster image package show-repository 
cluster image update -version 9.6P3 
cluster image show-update-progress

storage failover takeover -ofnode shlab3-01
storage failover giveback -ofnode shlab3-01
storage failover giveback-show 
storage failover show
storage failover modify -node * -auto-giveback true

#coredump login sp exec follow command and http://vip/spi
system core
events all

#upgrade fw DQP
M3F2C10_A700S::*> storage firmware download -node M2F2C03_A700S-02  -package-url http://10.183.48.200/qual_devices.zip
Firmware download started. 
Unpacking package contents.                                               
Firmware downloaded. 

run -node M2F2C03_A700S-02
rdfile /etc/qual_devices_v3

#create data aggr
shlab3::> aggr create -aggregate shlab3_02_aggr1 -diskcount 7 -raidtype raid_dp -maxraidsize 7 -node shlab3-02
cdlab::> aggr add-disk -aggregate aggr0_delab_02 -disklist 1.0.10

#modify cluster info:
shlab3::> cluster identity modify -name shlab2 
shlab2::> node rename -node FAS2240-01 -newname shlab2-01 
shlab2::> aggr rename -aggregate aggr0 -newname aggr0_shlab2_01
shlab2::> run -node shlab2-01 -command disk show
Shlab2::*>security login password -username admin -vserver xxxx
